Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_115-The_Display_of_the_Pure_Land_of_Sukhavati-v1.tmx
Source language: bo
Languages: en

source: །དེ་བཞིན་དུ་སྟེང་གི་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབྱངས་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་སྐར་མའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་སྤོས་མཆོག་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་སྤོས་འོད་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་ཕུང་པོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་མེ་ཏོག་ཤིན་ཏུ་རྒྱས་པའི་རིགས་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་སཱ་ལའི་དབང་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཨུད་པལའི་དཔལ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དོན་ཡོད་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་རི་རབ་ལྟ་བུ་ཞེས་བྱ་བ་དང་།
en: Likewise, in the zenith, the bhagavān buddhas of the zenith, such as the Tathāgata Brahmaghoṣa, the Tathāgata Nakṣatrarāja, the Tathāgata Gandhottama, the Tathāgata Gandhaprabhāsa, the Tathāgata Heap of Incense, the Tathāgata Ratna­kusuma­saṃpuṣpita­gotra, the Tathāgata Sālendrarāja, the Tathāgata Ratnotpalaśrī, the Tathāgata Sarvārthadarśa, the Tathāgata Sumerukalpa,
